# Data Preprocessing and Combination with the Auxiliary Data

This file is used to train the model and generate the prediction result.

In [1]:
from src import preprocess
import pandas as pd

In [2]:
# Load the train dataset
file_path = './data/raw/train.csv'
df = pd.read_csv(file_path)

# Load the test dataset
file_path = './data/raw/test.csv'
df_test = pd.read_csv(file_path)

## Data Preprocessing

According to the exploratory data analysis, we will do the following data preprocessing.

#### Remove features that have only one value

In [3]:
df = preprocess.remove_no_use_features(df)
df_test = preprocess.remove_no_use_features(df_test)

# Show some basic statistics about the dataset
print('Shape of the dataset: ', df.shape)
df.head()

Shape of the dataset:  (60000, 14)

,rent_approval_date,town,block,street_name,flat_type,flat_model,floor_area_sqm,lease_commence_date,latitude,longitude,subzone,planning_area,region,monthly_rent
0,2021-09,jurong east,257,Jurong East Street 24,3 room,new generation,67.0,1983,1.344518,103.738630,yuhua east,jurong east,west region,1600
1,2022-05,bedok,119,bedok north road,4-room,new generation,92.0,1978,1.330186,103.938717,bedok north,bedok,east region,2250
2,2022-10,toa payoh,157,lorong 1 toa payoh,3-room,improved,67.0,1971,1.332242,103.845643,toa payoh central,toa payoh,central region,1900
3,2021-08,pasir ris,250,Pasir Ris Street 21,executive,apartment,149.0,1993,1.370239,103.962894,pasir ris drive,pasir ris,east region,2850
4,2022-11,kallang/whampoa,34,Whampoa West,3-room,improved,68.0,1972,1.320502,103.863341,bendemeer,kallang,central region,2100

#### Convert categorical features to numerical features

In [4]:
df = preprocess.encode_features(df)
df_test = preprocess.encode_features(df_test)

# Show some basic statistics about the dataset
print('Shape of the dataset: ', df.shape)
df.head()

Shape of the dataset:  (60000, 14)

,rent_approval_date,town,block,street_name,flat_type,flat_model,floor_area_sqm,lease_commence_date,latitude,longitude,subzone,planning_area,region,monthly_rent
0,8,12,545,239,3,10,67.0,1983,1.344518,103.738630,149,12,4,1600
1,16,1,86,577,4,10,92.0,1978,1.330186,103.938717,8,1,1,2250
2,21,23,184,827,3,5,67.0,1971,1.332242,103.845643,128,26,0,1900
3,7,16,529,328,1,3,149.0,1993,1.370239,103.962894,91,18,1,2850
4,22,14,939,475,3,5,68.0,1972,1.320502,103.863341,12,14,0,2100

#### Remove outliers

Using IQR based on Mahalanobis distance of each data point to remove outliers.

In [5]:
df_mahalanobis = preprocess.IQR(df)

print('Shape of the dataset after removing outliers using IQR: ', df_mahalanobis.shape)
df_mahalanobis.head()

Shape of the dataset after removing outliers using IQR:  (57500, 14)

,rent_approval_date,town,block,street_name,flat_type,flat_model,floor_area_sqm,lease_commence_date,latitude,longitude,subzone,planning_area,region,monthly_rent
0,8,12,545,239,3,10,67.0,1983,1.344518,103.738630,149,12,4,1600
1,16,1,86,577,4,10,92.0,1978,1.330186,103.938717,8,1,1,2250
2,21,23,184,827,3,5,67.0,1971,1.332242,103.845643,128,26,0,1900
3,7,16,529,328,1,3,149.0,1993,1.370239,103.962894,91,18,1,2850
4,22,14,939,475,3,5,68.0,1972,1.320502,103.863341,12,14,0,2100

Using Isolation Forest to remove outliers.

In [6]:
df_iso_forest = preprocess.IoslationForest(df)

# Show some basic statistics about the dataset after removing outliers
print('Shape of the dataset after removing outliers using Isolation Forest: ', df_iso_forest.shape)
df_iso_forest.head()

Shape of the dataset after removing outliers using Isolation Forest:  (59400, 14)

,rent_approval_date,town,block,street_name,flat_type,flat_model,floor_area_sqm,lease_commence_date,latitude,longitude,subzone,planning_area,region,monthly_rent
0,8,12,545,239,3,10,67.0,1983,1.344518,103.738630,149,12,4,1600
1,16,1,86,577,4,10,92.0,1978,1.330186,103.938717,8,1,1,2250
2,21,23,184,827,3,5,67.0,1971,1.332242,103.845643,128,26,0,1900
3,7,16,529,328,1,3,149.0,1993,1.370239,103.962894,91,18,1,2850
4,22,14,939,475,3,5,68.0,1972,1.320502,103.863341,12,14,0,2100

In [7]:
# df = preprocess.remove_outliers(df)

#### Dimensionality reduction

Combine the features that have similar meaning, for example:

- `town`, `block`, `street_name` are all related to the location of the flat,
- `floor_area_sqm`, `flat_type`, `flat_model` are all related to the size of the flat.
- `subzone`, `planning_area`, `region` are all related to more general location of the flat.

In [8]:
# df = preprocess.dimensionality_reduction(df)
# df_test = preprocess.dimensionality_reduction(df_test)

# Show some basic statistics about the dataset
print('Shape of the dataset: ', df.shape)
df.head()

Shape of the dataset:  (60000, 14)

,rent_approval_date,town,block,street_name,flat_type,flat_model,floor_area_sqm,lease_commence_date,latitude,longitude,subzone,planning_area,region,monthly_rent
0,8,12,545,239,3,10,67.0,1983,1.344518,103.738630,149,12,4,1600
1,16,1,86,577,4,10,92.0,1978,1.330186,103.938717,8,1,1,2250
2,21,23,184,827,3,5,67.0,1971,1.332242,103.845643,128,26,0,1900
3,7,16,529,328,1,3,149.0,1993,1.370239,103.962894,91,18,1,2850
4,22,14,939,475,3,5,68.0,1972,1.320502,103.863341,12,14,0,2100

#### Combine the auxiliary data

Location relevant data: shopping malls, mrt stations, primary school.

In [9]:
df = preprocess.AddAuxiliaryFeatures(df, radius=1, shopping_malls_path='./data/raw/auxiliary-data/sg-shopping-malls.csv',
                                        mrt_planned_path='./data/raw/auxiliary-data/sg-mrt-planned-stations.csv',
                                        mrt_existing_path='./data/raw/auxiliary-data/sg-mrt-existing-stations.csv',
                                        primary_schools_path='./data/raw/auxiliary-data/sg-primary-schools.csv')
df_test = preprocess.AddAuxiliaryFeatures(df_test, radius=1, shopping_malls_path='./data/raw/auxiliary-data/sg-shopping-malls.csv',
                                        mrt_planned_path='./data/raw/auxiliary-data/sg-mrt-planned-stations.csv',
                                        mrt_existing_path='./data/raw/auxiliary-data/sg-mrt-existing-stations.csv',
                                        primary_schools_path='./data/raw/auxiliary-data/sg-primary-schools.csv')
df = df.drop(columns=['latitude', 'longitude'], axis=1)
df_test = df_test.drop(columns=['latitude', 'longitude'], axis=1)

# Show some basic statistics about the dataset
print('Shape of the dataset: ', df.shape)
df.head()

Shape of the dataset:  (60000, 20)

,rent_approval_date,town,block,street_name,flat_type,flat_model,floor_area_sqm,lease_commence_date,subzone,planning_area,region,monthly_rent,Shopping Malls Closest Dist,Shopping Malls Count 1km,Planned MRT Stations Closest Dist,Planned MRT Stations Count 1km,Existing MRT Stations Closest Dist,Existing MRT Stations Count 1km,Primary Schools Closest Dist,Primary Schools Count 1km
0,8,12,545,239,3,10,67.0,1983,149,12,4,1600,1.202674,0,0.675002,2,0.699127,1,0.334846,3
1,16,1,86,577,4,10,92.0,1978,8,1,1,2250,1.114338,0,0.904344,1,0.898991,1,0.607716,5
2,21,23,184,827,3,5,67.0,1971,128,26,0,1900,0.468297,3,1.183876,0,0.218603,4,0.425760,2
3,7,16,529,328,1,3,149.0,1993,91,18,1,2850,0.402359,1,0.516206,1,1.546040,0,0.564969,3
4,22,14,939,475,3,5,68.0,1972,12,14,0,2100,1.073354,0,2.818105,0,0.187856,3,0.271723,2

In [10]:
save_path = './data/processed/train.csv'
# move the target column to the last
df = df[[c for c in df if c not in ['monthly_rent']] + ['monthly_rent']]
df.to_csv(save_path, index=False)

save_path = './data/processed/test.csv'
df_test.to_csv(save_path, index=False)